{
  "recipes": [
    {
      "id": "0",
      "title": "Mushroom soup",
      "image": "mushroom_soup",
      "description": "Make the most of mushrooms with this comforting mushroom soup recipe made with cream, onions and garlic. Serve for lunch or as a starter with crusty bread",
      "ingredients": [
        "90g butter",
        "2 medium onions, roughly chopped",
        "1 garlic clove, crushed",
        "500g mushrooms, finely chopped (chestnut or button mushrooms work well)",
        "2 tbsp plain flour",
        "1l hot chicken stock",
        "1 bay leaf",
        "4 tbsp single cream",
        "small handful flat-leaf parsley, roughly chopped, to serve (optional)"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the butter in a large saucepan and cook the onions and garlic until soft but not browned, about 8-10 mins.",
        "STEP 2",
        "Add the mushrooms and cook over a high heat for another 3 mins until softened. Sprinkle over the flour and stir to combine. Pour in the chicken stock, bring the mixture to the boil, then add the bay leaf and simmer for another 10 mins.",
        "STEP 3",
        "Remove and discard the bay leaf, then remove the mushroom mixture from the heat and blitz using a hand blender until smooth. Gently reheat the soup and stir through the cream (or, you could freeze the soup at this stage – simply stir through the cream when heating). Scatter over the parsley, if you like, and serve."
      ],
      "tags": [
        "4 servings",
        "easy",
        "soup",
        "mushrooms"
      ],
      "prepTime": "10 mins",
      "cookTime": "25 mins",
      "author": "tarilang",
      "link": "https://www.bbcgoodfood.com/recipes/mushroom-soup"
    },
    {
      "id": "1",
      "title": "10-minute couscous salad",
      "image": "couscous_salad",
      "description": "This makes a great lunchbox filler for a day out and is equally good at home from the fridge.",
      "ingredients": [
        "100g couscous",
        "200ml hot low salt vegetable stock (from a cube is fine)",
        "2 spring onions",
        "1 red pepper",
        "½ cucumber",
        "50g feta cheese, cubed",
        "2tbsp pesto",
        "2tbsp pine nuts"
      ],
      "cookingSteps": [
        "STEP 1",
        "Tip the couscous into a large bowl and pour over the stock. Cover, then leave for 10 mins until fluffy and all the stock has been absorbed. Meanwhile, slice the onions and pepper, and dice the cucumber. Add these to the couscous, fork through the pesto, crumble in the feta, then sprinkle over pine nuts to serve."
      ],
      "tags": [
        "2 servings",
        "easy",
        "couscous",
        "salad"
      ],
      "prepTime": "10 mins",
      "cookTime": "0",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/10minute-couscous-salad"
    },
    {
      "id": "2",
      "title": "Caponata pasta",
      "image": "caponata_pasta",
      "description": "Whip up our easy vegetarian caponata pasta in just 20 minutes. It's simple to make, budget-friendly and packs three of your five-a-day into one delicious meal.",
      "ingredients": [
        "4 tbsp olive oil (or use the oil from your chargrilled veg, see below)",
        "1 large onion, finely chopped",
        "4 garlic cloves, finely sliced",
        "250g chargrilled Mediterranean veg (peppers and aubergines, if possible) from a jar, pot or deli counter, drained if in oil (you can use this oil in place of the olive oil) and roughly chopped",
        "400g can chopped tomatoes",
        "1 tbsp small capers",
        "2 tbsp raisins",
        "350g rigatoni, penne or another short pasta shape",
        "bunch basil leaves, picked",
        "parmesan (or vegetarian alternative), shaved, to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the oil in a large pan and cook the onion for 8-10 mins until starting to caramelise (or for longer if you have time – the sweeter the better). Add the garlic for the final 2 mins of cooking time.",
        "STEP 2",
        "Tip in the mixed veg, tomatoes, capers and raisins. Season well and simmer, uncovered, for 10 mins, or until you have a rich sauce.",
        "STEP 3",
        "Meanwhile, boil the kettle. Pour the kettleful of water into a large pan with a little salt and bring back to the boil. Add the pasta and cook until tender with a little bite, then drain, reserving some of the pasta water. Tip the pasta into the sauce, adding a splash of pasta water if it needs loosening. Scatter with the basil leaves and parmesan, if you like, and serve straight from the pan"
      ],
      "tags": [
        "4 servings",
        "easy",
        "pasta"
      ],
      "prepTime": "2 mins",
      "cookTime": "18 mins",
      "author": "Cassie Best",
      "link": "https://www.bbcgoodfood.com/recipes/caponata-pasta"
    },
    {
      "id": "3",
      "title": "Forest fruit & banana smoothie",
      "image": "forest_fruit_banana_smoothie",
      "description": "For a smooth start to your day try this ultra-easy breakfast drink.",
      "ingredients": [
        "frozen fruits of the forest",
        "banana, sliced",
        "low-fat fruits of the forest yogurt"
      ],
      "cookingSteps": [
        "STEP 1",
        "Whizz frozen fruits of the forest and sliced banana in a food processor with low-fat fruits of the forest yogurt."
      ],
      "tags": [
        "1 serving",
        "easy",
        "smoothie"
      ],
      "prepTime": "3 mins",
      "cookTime": "0 mins",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/forest-fruit-banana-smoothie"
    },
    {
      "id": "4",
      "title": "Jammy blackberry & almond crumble cake",
      "image": "jammy_blackberry_almond_crumble_cake",
      "description": "Enjoy these blackberry and almond cake slices for afternoon tea, or as dessert served with vanilla ice cream. They're made with fresh blackberries and jam.",
      "ingredients": [
        "225g butter, plus extra for the tin",
        "225g golden caster sugar, plus 1 tbsp",
        "3 medium eggs",
        "275g plain flour",
        "2 tsp baking powder",
        "50g ground almonds",
        "2 tbsp milk",
        "1 tsp vanilla or almond extract",
        "3 tbsp berry jam of your choice (we used blackcurrant)",
        "150g blackberries",
        "handful of flaked almonds"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the oven to 180C/160C fan/gas 4, butter a 20cm square tin and line with baking parchment. Beat 200g of the butter and 200g of the sugar together in a large bowl using an electric whisk until light and fluffy. Beat in the eggs, one at a time, until well combined. When smooth and creamy, add 225g of the flour, the baking powder, almonds, milk and vanilla, and mix to combine.",
        "STEP 2",
        "Scrape the mixture into the tin and level the surface with a spatula. Dot over teaspoons of jam, then scatter over the blackberries, pressing them in gently.",
        "STEP 3",
        "To make the crumble topping, weigh the remaining 25g butter and 25g sugar into a bowl, add the rest of the flour and a pinch of salt. Rub the ingredients together between your fingertips until they are a crumbly consistency. Mix in the flaked almonds, then scatter the crumble over the cake. Scatter with the 1 tbsp caster sugar and bake for 45 mins until a skewer inserted into the middle comes out clean.",
        "STEP 4",
        "If the cake isn’t ready, return to the oven for 5-10 mins more, then check again. Leave to cool for at least 20 mins in the tin before slicing and serving."
      ],
      "tags": [
        "12-15 servings",
        "dessert",
        "cake"
      ],
      "prepTime": "2 mins",
      "cookTime": "45 mins",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/jammy-blackberry-almond-crumble-cake"
    },
    {
      "id": "5",
      "title": "Chilli chicken with peanut noodles",
      "image": "chilli_chicken_with_peanut_noodles",
      "description": "Whip up this healthy chilli chicken noodle bowl in just 25 minutes. The addition of peanut butter gives it richness yet it's still under 500 calories.",
      "ingredients": [
        "For the stir-fry",
        "",
        "2 tsp rapeseed oil",
        "2 skinless, boneless chicken thighs, about 225g in total, all fat removed, chopped",
        "3 large garlic cloves , finely grated",
        "1 tbsp ginger , cut into matchsticks",
        "1 red chilli , deseeded and finely chopped",
        "175g Tenderstem broccoli , stems sliced on the angle, florets left whole",
        "1 red pepper , deseeded and chopped",
        "½ tsp tamari",
        "",
        "For the noodles",
        "",
        "2 nests wholewheat noodles",
        "1 tbsp sugar-free peanut butter",
        "½ lime , zested and juiced",
        "1 tsp ground cumin"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the oil in a wok and add all the stir-fry ingredients except for the tamari. Toss over a high heat for a min, then cover, reduce the heat and cook for 5 mins more until the chicken is tender. Toss through the tamari.",
        "STEP 2",
        "Meanwhile, cook the noodles in a pan of boiling water for 5 mins. Drain, but reserve the water. Mix the peanut butter, lime juice and zest, cumin and 3 tbsp of the water, then toss with the noodles until coated. Serve with the stir-fry."
      ],
      "tags": [
        "2 servings",
        "easy",
        "chilli",
        "chicken",
        "noodles"
      ],
      "prepTime": "15 mins",
      "cookTime": "10 mins",
      "author": "Sara Buenfeld",
      "link": "https://www.bbcgoodfood.com/recipes/chilli-chicken-peanut-noodles"
    },
    {
      "id": "6",
      "title": "Veggie hummus pasta salad",
      "image": "veggie_hummus_and_pasta_salad",
      "description": "Make your own hummus in this family pasta salad. Dish up for little ones first, then scatter with pul biber chilli flakes and crumbled feta for the grown-ups.",
      "ingredients": [
        "400g can chickpeas, drained and liquid reserved",
        "1 tbsp tahini",
        "2 tbsp extra virgin olive oil",
        "½ garlic clove",
        "½ lemon, zested and juiced",
        "250g short pasta of your choice",
        "50g baby spinach, roughly chopped",
        "200g cherry tomatoes halved (we used a mixture of red and yellow)",
        "¼ cucumber, quartered lengthways and cut into small triangles",
        "75g pitted olives of your choice, roughly chopped"
      ],
      "cookingSteps": [
        "STEP 1",
        "Boil the kettle. Tip half the chickpeas into a food processor, add roughly half the reserved liquid from the can (the liquid should come to just below the level of the chickpeas in the blender), the tahini, olive oil, garlic, lemon zest and juice and some seasoning. Blitz until you have a smooth, loose hummus. Check for seasoning.",
        "STEP 2",
        "Cook the pasta following pack instructions. Drain, reserving a mugful of the cooking water, and rinse the under cold running water for a few seconds until cool.",
        "STEP 3",
        "Toss the cooked pasta, spinach, tomatoes, cucumbers, olives, the rest of the chickpeas and the hummus dressing together in a large bowl until everything is well-coated. Add a splash of the reserved pasta cooking water if the dressing is too thick. Will keep covered and chilled for up to 6 hrs, or in an airtight container in a cool bag for 2 hrs. Add a splash of water to loosen the dressing again before serving."
      ],
      "tags": [
        "4 servings",
        "easy",
        "salad",
        "pasta"
      ],
      "prepTime": "20 mins",
      "cookTime": "10 mins",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/veggie-hummus-pasta-salad"
    },
    {
      "id": "7",
      "title": "Chorizo & mozzarella gnocchi bake",
      "image": "chorizo_mozzarella_gnocchi_bake",
      "description": "Upgrade cheesy tomato pasta with gnocchi, chorizo and mozzarella for a comforting bake that makes an excellent midweek meal.",
      "ingredients": [
        "1 tbsp olive oil",
        "1 onion , finely chopped",
        "2 garlic cloves , crushed",
        "120g chorizo , diced",
        "2 x 400g cans chopped tomatoes",
        "1 tsp caster sugar",
        "600g fresh gnocchi",
        "125g mozzarella ball, cut into chunks",
        "small bunch of basil , torn",
        "green salad , to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the oil in a medium pan over a medium heat. Fry the onion and garlic for 8-10 mins until soft. Add the chorizo and fry for 5 mins more. Tip in the tomatoes and sugar, and season. Bring to a simmer, then add the gnocchi and cook for 8 mins, stirring often, until soft. Heat the grill to high.",
        "STEP 2",
        "Stir ¾ of the mozzarella and most of the basil through the gnocchi. Divide the mixture between six ovenproof ramekins, or put in one baking dish. Top with the remaining mozzarella, then grill for 3 mins, or until the cheese is melted and golden. Season, scatter over the remaining basil and serve with green salad."
      ],
      "tags": [
        "6 servings",
        "easy",
        "gnocchi"
      ],
      "prepTime": "10 mins",
      "cookTime": "25 mins",
      "author": "Marianne Turner",
      "link": "https://www.bbcgoodfood.com/recipes/chorizo-mozzarella-gnocchi-bake"
    },
    {
      "id": "8",
      "title": "Meatball & tomato soup",
      "image": "meatball_tomato_soup",
      "description": "Get three of your 5-a-day in one serving with this healthy, low-calorie tomato soup. The addition of meatballs and giant couscous means it's filling, too.",
      "ingredients": [
        "1½ tbsp rapeseed oil",
        "1 onion, finely chopped",
        "2 red peppers, deseeded and sliced",
        "1 garlic clove, crushed",
        "½ tsp chilli flakes",
        "2 x 400g cans chopped tomatoes",
        "100g giant couscous",
        "500ml hot vegetable stock",
        "12 pork meatballs",
        "150g baby spinach",
        "½ small bunch of basil",
        "grated parmesan, to serve (optional)"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the oil in a saucepan. Fry the onion and peppers for 7 mins, then stir through the garlic and chilli flakes and cook for 1 min. Add the tomatoes, giant couscous and veg stock and bring to a simmer.",
        "STEP 2",
        "Season to taste, then add the meatballs and spinach. Simmer for 5-7 mins or until cooked through. Ladle into bowls and top with the basil and some parmesan, if you like."
      ],
      "tags": [
        "4 servings",
        "easy",
        "soup",
        "tomato"
      ],
      "prepTime": "5 mins",
      "cookTime": "15 mins",
      "author": "Esther Clark",
      "link": "https://www.bbcgoodfood.com/recipes/meatball-tomato-soup"
    },
    {
      "id": "9",
      "title": "Sticky barbecue chicken",
      "image": "sticky_barbecue_chicken",
      "description": "Nothing beats sticky chicken with barbecue sauce. Start in the oven to make sure it's cooked properly, then grill over hot coals for that lovely BBQ flavour.",
      "ingredients": [
        "4 chicken thighs and 4 chicken drumsticks, skin on",
        "",
        "For the barbecue sauce",
        "",
        "1 tbsp soy sauce",
        "1 tbsp cider vinegar",
        "4 tbsp light brown soft sugar",
        "4 tbsp tomato ketchup",
        "75ml apple juice",
        "1 tbsp Dijon mustard"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat oven to 180C/160C fan/gas 4. Put the chicken in a roasting tin, season well and cook for 40 mins or until cooked through. Either carry on with the recipe or cool and chill. This step can be done up to two days ahead.",
        "STEP 2",
        "Put the sauce ingredients in a pan and bring to a simmer, then keep cooking until it thickens a little and looks shiny. Use straight away or cool and chill. The sauce will keep for a week in the fridge.",
        "STEP 3",
        "Heat a barbecue until the coals are glowing white hot. Brush the chicken pieces all over with the sauce and barbecue them on each side until they are browned and sticky, then brush once more with the sauce. Don’t worry about cooking them through, as they are already cooked. If you want to cook them indoors, coat them in the sauce and grill on a medium heat on all sides."
      ],
      "tags": [
        "4-6 servings",
        "easy",
        "chicken",
        "barbecue"
      ],
      "prepTime": "10 mins",
      "cookTime": "30 - 40 mins",
      "author": "Lulu Grimes",
      "link": "https://www.bbcgoodfood.com/recipes/sticky-barbecue-chicken"
    },
    {
      "id": "10",
      "title": "Raspberry mojito",
      "image": "raspberry_mojito",
      "description": "Blend fresh raspberries with lime, mint, sugar, white rum and sparkling water to make a punchy raspberry mojito that's perfect for summer parties.",
      "ingredients": [
        "8-10 raspberries",
        "1 lime, chopped into large chunks",
        "2 tsp granulated sugar",
        "2 mint sprigs, leaves picked",
        "ice",
        "100ml white rum",
        "sparkling water, to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Divide the raspberries, lime and sugar between two tall glasses and muddle by gently crushing with a muddler or the end of a bar spoon. The fruits should start to release their juices, which will mix with the sugar.",
        "STEP 2",
        "Put half the mint leaves in the palm of one of your hands, then clap the other hand on top of the leaves – this bruises them just enough to release their flavour. Drop the bruised mint leaves into one of the glasses, then repeat with the remaining mint, dropping it into the second glass.",
        "STEP 3",
        "Add a handful of ice to each glass, followed by the rum. Stir, then top up with sparkling water. Stir briefly until just combined, then serve."
      ],
      "tags": [
        "2 servings",
        "easy",
        "drink",
        "cocktail"
      ],
      "prepTime": "5 mins",
      "cookTime": "0 mins",
      "author": "Miriam Nice",
      "link": "https://www.bbcgoodfood.com/recipes/raspberry-mojito"
    },
    {
      "id": "11",
      "title": "Mango chutney campfire cheese toasties",
      "image": "mango_chutney_campfire_cheese_toasties",
      "description": "Gather round a campfire and make these moreish mango chutney and cheese toasties for a simple family supper. Serve with more chutney for dunking.",
      "ingredients": [
        "100g grated mozzarella",
        "100g medium or mild cheddar, grated",
        "2 spring onions, thinly sliced (optional)",
        "8 slices white bread",
        "4 tbsp mango chutney, plus extra to serve",
        "small knob of butter, for frying (optional)"
      ],
      "cookingSteps": [
        "STEP 1",
        "Combine both cheeses and the spring onions, if using, in a bowl. Pile the cheese mix over four of the bread slices, then spread 1 tbsp chutney over each of the remaining slices. Sandwich the slices together to make four toasties.",
        "STEP 2",
        "If you’re cooking over a barbecue, put the sandwiches on a griddle for 2 mins, flip and cook for 2 mins more. Transfer to sheets of foil using tongs and tightly wrap. Return to the griddle and cook for 3-4 mins more, or until the cheese is melted. Alternatively, melt a little butter in a pan. Fry the sandwiches for 2-3 mins on each side, weighing them down with a second pan or other heavy heatproof object. Cut the toasties into fingers and serve with more chutney for dunking."
      ],
      "tags": [
        "4 servings",
        "easy",
        "cheese",
        "toast"
      ],
      "prepTime": "10 mins",
      "cookTime": "10 mins",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/mango-chutney-campfire-cheese-toasties"
    },
    {
      "id": "12",
      "title": "Rainbow tomato salad",
      "image": "rainbow_tomato_salad",
      "description": "Use seasonal tomatoes in different colours, shapes and sizes and sprinkle basil to give this side salad a dazzling finish.",
      "ingredients": [
        "1kg ripe tomato of various colours, shapes and sizes, at room temperature",
        "sea salt , to season",
        "2 tsp balsamic vinegar",
        "drizzle extra-virgin olive oil",
        "basil leaves"
      ],
      "cookingSteps": [
        "STEP 1",
        "Slice the tomatoes and arrange on a platter, then season with sea salt and some pepper. Drizzle over the vinegar and oil, and scatter over the basil."
      ],
      "tags": [
        "6 servings",
        "easy",
        "tomato",
        "salad"
      ],
      "prepTime": "10 mins",
      "cookTime": "0 mins",
      "author": "Cassie Best",
      "link": "https://www.bbcgoodfood.com/recipes/rainbow-tomato-salad"
    },
    {
      "id": "13",
      "title": "Butter bean & chorizo stew",
      "image": "butter_bean_chorizo_stew",
      "description": "A hearty stew to feed a family with just four ingredients. Spicy chorizo and fresh pesto provide tons of flavour and it's on the table in just 20 minutes.",
      "ingredients": [
        "200g cooking chorizo",
        "2 x 400g cans chopped tomatoes",
        "2 x 400g cans drained butter beans",
        "1 tub fresh pesto, or 130g jar pesto"
      ],
      "cookingSteps": [
        "STEP 1",
        "Slice the chorizo and tip into a large saucepan over a medium heat. Fry gently for 5 mins or until starting to turn dark brown. Add the tomatoes and butter beans, bring to the boil, then simmer for 10 mins. Swirl through the pesto, season lightly and ladle into four bowls."
      ],
      "tags": [
        "4 servings",
        "easy",
        "stew",
        "beans"
      ],
      "prepTime": "5 mins",
      "cookTime": "15 mins",
      "author": "Esther Clark",
      "link": "https://www.bbcgoodfood.com/recipes/butter-bean-chorizo-stew"
    },
    {
      "id": "14",
      "title": "Pasta with salmon & peas",
      "image": "pasta_with_salmon_peas",
      "description": "Make this salmon pasta in under 20 minutes for a dinner the whole family can enjoy. Kids will love the fun-shaped pasta while packing in fibre and omega-3.",
      "ingredients": [
        "240g wholewheat fusilli",
        "knob of butter",
        "1 large shallot, finely chopped",
        "140g frozen peas",
        "2 skinless salmon fillets, cut into chunks",
        "140g low-fat crème fraîche",
        "½ low-salt vegetable stock cube",
        "small bunch of chives, snipped"
      ],
      "cookingSteps": [
        "STEP 1",
        "Bring a pan of water to the boil and cook the fusilli according to the pack instructions.",
        "STEP 2",
        "Meanwhile, heat a knob of butter in a saucepan, then add the shallot and cook for 5 mins or until softened.",
        "STEP 3",
        "Add the peas, salmon, crème fraîche and 50ml water. Crumble in the stock cube.",
        "STEP 4",
        "Cook for 3-4 mins until cooked through, stir in the chives and some black pepper. Then stir through to coat the pasta. Serve in bowls."
      ],
      "tags": [
        "4 servings",
        "easy",
        "pasta",
        "salmon",
        "peas"
      ],
      "prepTime": "5 mins",
      "cookTime": "10 - 12 mins",
      "author": "Caroline Hire – Food writer",
      "link": "https://www.bbcgoodfood.com/recipes/pasta-salmon-peas"
    },
    {
      "id": "15",
      "title": "One-pan egg & veg brunch",
      "image": "onepan_egg_veg_brunch",
      "description": "With courgette, peppers and eggs, this vegetarian dish is a filling, healthy breakfast for all the family – kids will enjoy dipping toast into soft egg yolk.",
      "ingredients": [
        "300g baby new potatoes , halved",
        "½ tbsp rapeseed oil",
        "1 knob of butter",
        "1 courgette , cut into small chunks",
        "1 yellow pepper , cut into small chunks",
        "1 red pepper , cut into small chunks",
        "2 spring onions , finely sliced",
        "1 garlic clove , crushed",
        "1 sprig thyme , leaves picked",
        "4 eggs",
        "toast , to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Boil the new potatoes for 8 mins, then drain.",
        "STEP 2",
        "Heat the oil and butter in a large non-stick frying pan, then add the courgette, peppers, potatoes and a little salt and pepper. Cook for 10 mins, stirring from time to time until everything is starting to brown. Add the spring onions, garlic and thyme and cook for 2 mins more.",
        "STEP 3",
        "Make four spaces in the pan and crack in the eggs. Cover with foil or a lid and cook for around 4 mins, or until the eggs are cooked (with the yolks soft for dipping into). Sprinkle with more thyme leaves and ground black pepper if you like. Serve with toast."
      ],
      "tags": [
        "4 servings",
        "easy",
        "brunch",
        "egg"
      ],
      "prepTime": "5 mins",
      "cookTime": "25 mins",
      "author": "Caroline Hire – Food writer",
      "link": "https://www.bbcgoodfood.com/recipes/one-pan-egg-veg-brunch"
    },
    {
      "id": "16",
      "title": "One-pan piri piri chicken dinner",
      "image": "one_pan_piri_piri_chicken_dinner",
      "description": "Try this one-pan piri piri chicken for a family dinner and adjust the chilli levels to suit your family's tolerance. You can use a whole chicken instead, if you like.",
      "ingredients": [
        "1kg bone-in chicken thighs and drumsticks (equal quantities of each saves any arguments)",
        "500g baby potatoes, thickly sliced",
        "2 peppers (1 red, 1 yellow), thickly sliced",
        "200g cherry tomatoes",
        "handful of coriander leaves, chopped",
        "buttered corn on the cob, to serve",
        "",
        "For the marinade",
        "",
        "1½ tsp smoked paprika",
        "25g light brown soft sugar",
        "1 lime, zested and juiced",
        "1 tsp dried chilli flakes (use less if you prefer less heat)",
        "2 garlic cloves, chopped",
        "4 tbsp olive oil",
        "½ bunch of fresh oregano, leaves picked or 1 tbsp dried oregano",
        "1 red chilli (optional), deseeded and chopped",
        "1 tbsp red wine or port (optional)"
      ],
      "cookingSteps": [
        "STEP 1",
        "Pound all the marinade ingredients together with 1 tsp salt using a large pestle and mortar, or blitz in a mini chopper to create a loose paste. Slash each chicken piece a few times, then tip into a bowl and coat in the marinade. Cover and chill for at least 1 hr or up to 24 hrs.",
        "STEP 2",
        "Heat the oven to 220C/200C fan/gas 7. Tip the chicken along with the marinade and potatoes into a roasting tin. Toss together, then arrange the chicken on top of the potatoes, thighs skin-side up. Roast for 35-40 mins until the chicken has browned.",
        "STEP 3",
        "Remove the tin from the oven and mix the peppers in with the potatoes, baste the chicken in some of the juices in the tin and turn the drumsticks. Nestle the cherry tomatoes in among the chicken and roast for another 20-25 mins until the chicken is cooked through, the skin is crisp and the vegetables are nicely roasted. Scatter with the coriander and some flaky sea salt, if you like, and serve straight from the tin with the buttered corn on the side."
      ],
      "tags": [
        "4 servings",
        "easy",
        "one-pan",
        "chicken"
      ],
      "prepTime": "30 mins",
      "cookTime": "1 hour",
      "author": "Paul Ainsworth",
      "link": "https://www.bbcgoodfood.com/recipes/one-pan-piri-piri-chicken-dinner"
    },
    {
      "id": "17",
      "title": "Sweet & sour tofu",
      "image": "sweet_sour_tofu",
      "description": "Enjoy our sweet and sour tofu for one. With pineapple, red pepper, onion and Chinese flavourings, it’s vegan and healthy, delivering three of your 5-a-day.",
      "ingredients": [
        "1 tbsp rapeseed or vegetable oil",
        "75g extra-firm tofu , cut into 2cm chunks",
        "½ onion , cut into thin wedges",
        "½ red pepper , chopped into chunks",
        "1 large garlic clove , finely sliced",
        "80g fresh pineapple chunks",
        "1 tbsp low-salt ketchup",
        "1 tbsp rice wine vinegar",
        "½ tbsp dark soy sauce",
        "cooked basmati rice , to serve",
        "sesame seeds , to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat half the oil in a non-stick frying pan over a medium heat. Add the tofu and fry for 5 mins, turning regularly, until golden brown on all sides. Remove to a plate with a slotted spoon and set aside.",
        "STEP 2",
        "Heat the remaining oil in the pan over a high heat. Fry the onion, pepper and garlic for 5-6 mins, or until the veg begins to soften. Add the pineapple, ketchup, vinegar, soy sauce and 50ml water, and simmer for 1 min, or until slightly reduced. Stir the tofu back into the pan.",
        "STEP 3",
        "Cook the basmati rice following pack instructions. Serve the tofu in bowls with the rice and a sprinkling of sesame seeds."
      ],
      "tags": [
        "1 serving",
        "easy",
        "tofu"
      ],
      "prepTime": "10 mins",
      "cookTime": "15 mins",
      "author": "Esther Clark",
      "link": "https://www.bbcgoodfood.com/recipes/sweet-sour-tofu"
    },
    {
      "id": "18",
      "title": "Vegetarian ramen",
      "image": "vegetarian_ramen",
      "description": "Rustle up this warming veggie ramen in just 15 minutes. Think of it as healthy fast food – it's low-fat, low-calorie and low-cost as well.",
      "ingredients": [
        "80g pack instant noodles (look for an Asian brand with a flavour like sesame)",
        "2 spring onions , finely chopped",
        "½ head pak choi",
        "1 egg",
        "1 tsp sesame seeds",
        "chilli sauce , to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Cook the noodles with the sachet of flavouring provided (or use stock instead of the sachet, if you have it). Add the spring onions and pak choi for the final min.",
        "STEP 2",
        "Meanwhile, simmer the egg for 6 mins from boiling, run it under cold water to stop it cooking, then peel it. Toast the sesame seeds in a frying pan.",
        "STEP 3",
        "Tip the noodles and greens into a deep bowl, halve the boiled egg and place on top. Sprinkle with sesame seeds, then drizzle with the sauce or sesame oil provided with the noodles, and chilli sauce, if using."
      ],
      "tags": [
        "1 serving",
        "easy",
        "ramen"
      ],
      "prepTime": "5 mins",
      "cookTime": "10 mins",
      "author": "Lulu Grimes",
      "link": "https://www.bbcgoodfood.com/recipes/vegetarian-ramen"
    },
    {
      "id": "19",
      "title": "Miso mushroom & tofu noodle soup",
      "image": "miso_mushroom_tofu_noodle_soup",
      "description": "Rustle up this miso, mushroom and tofu noodle soup with just six simple ingredients. Healthy and low in calories, it makes a tasty light lunch or supper.",
      "ingredients": [
        "1 tbsp rapeseed oil",
        "70g mixed mushrooms , sliced",
        "50g smoked tofu , cut into small cubes",
        "½ tbsp brown rice miso paste",
        "50g dried buckwheat or egg noodles",
        "2 spring onions , shredded"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat half the oil in a frying pan over a medium heat. Add the mushrooms and fry for 5-6 mins, or until golden. Transfer to a bowl using a slotted spoon and set aside. Add the remaining oil to the pan and fry the tofu for 3-4 mins, or until evenly golden.",
        "STEP 2",
        "Mix the miso paste with 325ml boiling water in a jug. Cook the noodles following pack instructions, then drain and transfer to a bowl. Top with the mushrooms and tofu, then pour over the miso broth. Scatter over the spring onions just before serving."
      ],
      "tags": [
        "1 serving",
        "easy",
        "tofu",
        "mushroom",
        "soup"
      ],
      "prepTime": "10 mins",
      "cookTime": "15 mins",
      "author": "Esther Clark",
      "link": "https://www.bbcgoodfood.com/recipes/miso-mushroom-tofu-noodle-soup"
    },
    {
      "id": "20",
      "title": "Cod with an orange & dill crumb and hasselback potato",
      "image": "cod_and_hasselback_potato",
      "description": "This is a dish that's big on flavour as well as texture with a crunchy topping to succulent white fish and crisp potato to go with it, a healthy dinner for one.",
      "ingredients": [
        "1 large baking potato",
        "1 cod fillet (about 180g)",
        "1 slice bread (preferably seeded)",
        "zest ½ orange",
        "½ small pack dill , roughly chopped",
        "1 small garlic clove , crushed",
        "drizzle olive oil",
        "2 tbsp crème fraîche , to serve",
        "steamed vegetables , to serve (optional)"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat oven to 220C/200C fan/gas 7. Sit the potato on a large spoon and cut slits across it every 0.5cm (the edges of the spoon will stop the knife cutting all the way through the potato). Microwave for 10-12 mins until starting to soften (alternatively, bake in the oven for 1 hr 10 mins).",
        "STEP 2",
        "Meanwhile, prepare the topping for the fish. Blitz the bread in a food processor into breadcrumbs (or grate it). Combine the breadcrumbs with the orange zest, dill, garlic and seasoning. Season the cod, put it on a baking tray and top with the crumb.",
        "STEP 3",
        "Put the potato on the same tray, drizzle with oil and sprinkle with salt flakes. Bake for 12-15 mins until the fish is cooked and the potato is tender but crispy. Serve with cr ème fraîche and steamed vegetables, if you like."
      ],
      "tags": [
        "1 serving",
        "easy",
        "cod",
        "potato"
      ],
      "prepTime": "10 mins",
      "cookTime": "30 mins",
      "author": "Katie Marshall",
      "link": "https://www.bbcgoodfood.com/recipes/cod-orange-dill-crumb-and-hasselback-potato"
    },
    {
      "id": "21",
      "title": "Chicken breast with avocado salad",
      "image": "chicken_breast_with_avocado_salad",
      "description": "A satisfying solo salad that's superhealthy - great for a busy worknight supper.",
      "ingredients": [
        "1 skinless chicken breast",
        "2 tsp olive oil (1 for the salad)",
        "1 heaped tsp smoked paprika",
        "",
        "For the salad",
        "",
        "½ small avocado , diced",
        "1 tsp red wine vinegar",
        "1 tbsp flat-leaf parsley , roughly chopped",
        "1 medium tomato , chopped",
        "half small red onion , thinly sliced"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat grill to medium. Rub the chicken all over with 1 tsp of the olive oil and the paprika. Cook for 4-5 mins each side until lightly charred and cooked through.",
        "STEP 2",
        "Mix the salad ingredients together, season and add the rest of the oil. thickly slice the chicken and serve with salad."
      ],
      "tags": [
        "1 serving",
        "easy",
        "salad",
        "avocado",
        "chicken"
      ],
      "prepTime": "10 mins",
      "cookTime": "10 mins",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/chicken-breast-avocado-salad"
    },
    {
      "id": "22",
      "title": "Spicy courgette pitta pockets",
      "image": "spicy_courgette_pitta_pockets",
      "description": "Treat yourself to a solo supper of grilled vegetables, served in bread pockets with tahini, hummus, broad beans and harissa.",
      "ingredients": [
        "1 courgette , trimmed and thinly sliced lengthways",
        "2 tsp harissa paste",
        "2 tsp olive oil",
        "small handful broad beans (fresh or frozen)",
        "2 tbsp hummus",
        "1 spring onion , finely sliced",
        "1 tsp tahini paste",
        "small garlic clove , crushed",
        "squeeze lemon juice",
        "1 tbsp Greek-style yogurt",
        "1 large wholemeal pitta bread"
      ],
      "cookingSteps": [
        "STEP 1",
        "Toss the courgette slices in the harissa and olive oil, and season. Cook on a hot griddle pan for 2 mins each side or until tender. Transfer to a plate and set aside.",
        "STEP 2",
        "Cook the broad beans in boiling water for 2 mins, drain under cold running water, then slip them out of their outer skins. Discard the skins. Put the broad beans, hummus and spring onion in a small bowl and mix to combine.",
        "STEP 3",
        "In another bowl, mix the tahini, garlic, lemon juice and yogurt. Toast the pitta and split it to create 2 pockets. Spoon the hummus mix inside each pocket, followed by the spicy courgette slices and a drizzle of the yogurt mixture."
      ],
      "tags": [
        "1 serving",
        "easy",
        "pitta",
        "spicy"
      ],
      "prepTime": "10 mins",
      "cookTime": "6 mins",
      "author": "Good Food team",
      "link": "https://www.bbcgoodfood.com/recipes/spicy-courgette-pitta-pockets"
    },
    {
      "id": "23",
      "title": "Tamarind prawn curry",
      "image": "tamarind_prawn_curry",
      "description": "Our tamarind prawn curry will quickly become a family favourite. It's quick, healthy and low in fat and calories.",
      "ingredients": [
        "1 tbsp vegetable oil",
        "1 onion, chopped",
        "1 red chilli, finely chopped",
        "2 garlic cloves, crushed",
        "1 tbsp grated ginger",
        "1 tsp turmeric",
        "1 tsp cumin seeds",
        "1 tsp ground coriander",
        "400g can cherry tomatoes",
        "1-2 tbsp tamarind paste (see tip, below)",
        "250g raw king prawns",
        "250g cooked basmati rice",
        "handful of coriander leaves, to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Heat the oil in a frying pan over a medium heat and cook the onion for 5-8 mins until light golden. Stir in the chilli, garlic and ginger, and fry for another minute before adding the spices. Tip in the cherry tomatoes, swirl the can out with a splash of water and stir that into the pan as well.",
        "STEP 2",
        "Simmer for 5 mins until the tomatoes burst and the sauce thickens. Stir in the tamarind and prawns, and simmer for 2-3 mins until the prawns are cooked. Serve the curry on top of the rice, with the coriander scattered over."
      ],
      "tags": [
        "2 servings",
        "easy",
        "curry"
      ],
      "prepTime": "5 mins",
      "cookTime": "15 mins",
      "author": "Anna Glover",
      "link": "https://www.bbcgoodfood.com/recipes/tamarind-prawn-curry"
    },
    {
      "id": "24",
      "title": "Easy butter chicken",
      "image": "easy_butter_chicken",
      "description": "Fancy a healthy version of your favourite Friday night curry? Try our easy butter chicken – the meat can be marinaded the day before so you can get ahead on your prep.",
      "ingredients": [
        "500g skinless boneless chicken thighs",
        "",
        "For the marinade",
        "",
        "1 lemon, juiced",
        "2 tsp ground cumin",
        "2 tsp paprika",
        "1-2 tsp hot chilli powder",
        "200g natural yogurt",
        "",
        "For the curry",
        "",
        "2 tbsp vegetable oil",
        "1 large onion, chopped",
        "3 garlic cloves, crushed",
        "1 green chilli, deseeded and finely chopped (optional)",
        "thumb-sized piece ginger, grated",
        "1 tsp garam masala",
        "2 tsp ground fenugreek",
        "3 tbsp tomato purée",
        "300ml chicken stock",
        "50g flaked almonds, toasted",
        "",
        "To serve (optional)",
        "",
        "cooked basmati rice",
        "naan bread",
        "mango chutney or lime pickle",
        "fresh coriander",
        "lime wedges"
      ],
      "cookingSteps": [
        "STEP 1",
        "In a medium bowl, mix all the marinade ingredients with some seasoning. Chop the chicken into bite-sized pieces and toss with the marinade. Cover and chill in the fridge for 1 hr or overnight.",
        "STEP 2",
        "In a large, heavy saucepan, heat the oil. Add the onion, garlic, green chilli, ginger and some seasoning. Fry on a medium heat for 10 mins or until soft.",
        "STEP 3",
        "Add the spices with the tomato purée, cook for a further 2 mins until fragrant, then add the stock and marinated chicken. Cook for 15 mins, then add any remaining marinade left in the bowl. Simmer for 5 mins, then sprinkle with the toasted almonds. Serve with rice, naan bread, chutney, coriander and lime wedges, if you like."
      ],
      "tags": [
        "4 servings",
        "easy",
        "chicken"
      ],
      "prepTime": "15 mins",
      "cookTime": "35 mins",
      "author": "Jennifer Joyce",
      "link": "https://www.bbcgoodfood.com/recipes/easy-butter-chicken"
    },
    {
      "id": "25",
      "title": "Classic fish & chips",
      "image": "classic_fish_chips",
      "description": "Skip the takeaway, and spend a little effort perfecting fish & chips at home – you'll be rewarded with crisp, deeply golden fish and moreish chips.",
      "ingredients": [
        "about 1 litre sunflower oil, for frying",
        "2 thick skinless fillets of whiting, ling, pollock, haddock or cod (about 150g each)",
        "",
        "For the chips",
        "",
        "2 large Maris Piper potatoes",
        "1 tsp malt vinegar, plus extra to serve",
        "",
        "For the batter",
        "",
        "75g self-raising flour, plus extra for dusting",
        "25g cornflour",
        "small pinch of ground turmeric",
        "125g cold lager or fizzy water",
        "",
        "For the tartare sauce",
        "",
        "4 cornichons",
        "1 tsp capers",
        "1 shallot",
        "handful of parsley leaves, chopped",
        "5 tbsp mayonnaise"
      ],
      "cookingSteps": [
        "STEP 1",
        "Cut the potatoes into chips and soak in cold water for 5 mins, then wash until the water runs clear. Tip into a pan of cold water with a pinch of salt and 1 tsp vinegar. Bring to a simmer, then turn down the heat and simmer gently for 10-12 mins until cooked through but not falling apart. Drain gently, then place on a tray in a single layer and chill until needed. Can be prepared a day ahead.",
        "STEP 2",
        "To make the tartare sauce, chop the cornichons, capers and shallot (finely chop if you prefer a smooth sauce), then combine with the parsley, mayo and a pinch of salt. Will keep chilled for up to 24 hours.",
        "STEP 3",
        "When you’re ready to fry, prepare the batter. Tip the flours and turmeric into a bowl with a pinch of salt, pour over the beer or fizzy water, and mix quickly until everything just comes together to the consistency of double cream – do not over-beat, a few lumps are fine. Keep chilled.",
        "STEP 4",
        "Pour the oil into a deep, wide pan like a wok, or heat a deep-fat fryer to 180C. If using a pan or wok, ensure that it is no more than two-thirds full with oil. Heat the oil until it is shimmering and carefully lower in the chips using a slotted spoon. Fry for 8-10 mins, gently stirring occasionally until golden and crisp. Transfer to kitchen paper to drain.",
        "STEP 5",
        "Put a little flour in a dish, then bring the oil you used to cook the chips up to 185C, if you have a thermometer, or until a drizzle of batter sizzles and crisps in less than a minute. Working quickly, dust the fish in flour, then dredge through the batter. Hold the fillet above the batter to let the excess drip back into the bowl, then carefully lower into the oil. Fry the fillets for a minute until the batter is just starting to set, then take a spoon and drizzle the fillets with extra batter to create an even crunchier, wispy coating. Fry the fish for about 4 mins, turning once, until deep golden and crisp. Lift onto some kitchen paper to drain for a minute, then serve with the chips, tartare sauce, and plenty of salt and vinegar."
      ],
      "tags": [
        "2 servings",
        "easy",
        "fish",
        "potatoes"
      ],
      "prepTime": "25 mins",
      "cookTime": "30 mins",
      "author": "Barney Desmazery",
      "link": "https://www.bbcgoodfood.com/recipes/next-level-fish-chips"
    },
    {
      "id": "26",
      "title": "Chicken gyros",
      "image": "chicken_gyros",
      "description": "Barbecuing for a crowd? Make chicken gyros served with warm pittas to stuff with fresh tomatoes, onion, tzatziki and chips. Perfect for a summer gathering.",
      "ingredients": [
        "12 boneless, skinless chicken thighs",
        "",
        "For the marinade",
        "",
        "500g Greek yogurt",
        "2 lemons, juiced, ½ lemon zested",
        "100ml olive oil",
        "4 garlic cloves, very finely grated or crushed",
        "1 tbsp ground coriander",
        "1 tbsp ground cumin",
        "1 tbsp sweet paprika",
        "1 tsp dried oregano",
        "1 tsp dried thyme",
        "1 tsp cayenne pepper",
        "1 tsp crushed black pepper",
        "½ tsp ground cinnamon",
        "",
        "To serve",
        "",
        "2 red onions, halved and finely sliced",
        "4 tomatoes (plum work well) halved and sliced"
      ],
      "cookingSteps": [
        "STEP 1",
        "First, whisk all the marinade ingredients together with 1 tsp salt in a large bowl or, better still, a large plastic container that has a lid. Open out each chicken thigh, cover with a piece of baking parchment and flatten it with your hand, then lift off the paper and cut the thigh in half. Tip into the marinade and mix so it’s completely coated. Cover, chill and marinate for at least 1 hr or up to 24 hrs – the longer, the better.",
        "STEP 2",
        "Thread all the chicken onto two skewers so that both skewers go through each piece of meat, packing down tightly as you go to make a compact kebab (see tip, below).",
        "STEP 3",
        "Light a lidded barbecue, and let the flames die down. Once the coals have turned ashen, pile them up on one side with a single layer of coals scattered around the other side. Lay the chicken kebab on the side of the barbecue with only a few coals underneath. Put the lid down and cook for 45 mins, turning every 15 mins. To finish, lift the lid and roll the kebab over to the hotter side to char the meat, turning it every few minutes until well browned and cooked through. Prise the chicken pieces apart in the centre to check they’re cooked, or use a digital cooking thermometer – it should read 70C or more. Leave to rest for 5-10 mins while you cook the pittas (see recipe, opposite). Bring the kebab to the table and carve into thin slices with a serrated knife. Pile the carved meat into the warm pittas, then the sliced red onions and tomatoes, chips and tzatziki (see our recipes, below)."
      ],
      "tags": [
        "6 - 8 serving",
        "easy",
        "chicken"
      ],
      "prepTime": "40 mins",
      "cookTime": "1 hour",
      "author": "Barney Desmazery",
      "link": "https://www.bbcgoodfood.com/recipes/big-barbecue-chicken-kebab"
    },
    {
      "id": "27",
      "title": "Simple sushi",
      "image": "simple_sushi",
      "description": "Kids can help with this Japanese dish. They can help cook the sticky rice and then roll and assemble the pieces with their preferred ingredients.",
      "ingredients": [
        "For the rice",
        "300g sushi rice",
        "100ml rice wine vinegar",
        "2 tbsp golden caster sugar",
        "",
        "For the Japanese mayonnaise",
        "",
        "3 tbsp mayonnaise",
        "1 tbsp rice wine vinegar",
        "1 tsp soy sauce",
        "",
        "For the sushi",
        "",
        "25g bag nori (seaweed) sheets",
        "choose from the following fillings: cucumber strips, smoked salmon, white crabmeat, canned tuna, red pepper, avocado, spring onion",
        "",
        "To serve with all styles of sushi",
        "",
        "wasabi (optional - and fiery!)",
        "pickled ginger",
        "soy sauce"
      ],
      "cookingSteps": [
        "STEP 1",
        "KIDS the writing in bold is for you. ADULTS the rest is for you. TO MAKE SUSHI ROLLS: Pat out some rice. Lay a nori sheet on the mat, shiny-side down. Dip your hands in the vinegared water, then pat handfuls of rice on top in a 1cm thick layer, leaving the furthest edge from you clear.",
        "STEP 2",
        "Spread over some Japanese mayonnaise. Use a spoon to spread out a thin layer of mayonnaise down the middle of the rice.",
        "STEP 3",
        "Add the filling. Get your child to top the mayonnaise with a line of their favourite fillings – here we’ve used tuna and cucumber.",
        "STEP 4",
        "Roll it up. Lift the edge of the mat over the rice, applying a little pressure to keep everything in a tight roll.",
        "STEP 5",
        "Stick down the sides like a stamp. When you get to the edge without any rice, brush with a little water and continue to roll into a tight roll.",
        "STEP 6",
        "Wrap in cling film. Remove the mat and roll tightly in cling film before a grown-up cuts the sushi into thick slices, then unravel the cling film.",
        "STEP 7",
        "TO MAKE PRESSED SUSHI: Layer over some smoked salmon. Line a loaf tin with cling film, then place a thin layer of smoked salmon inside on top of the cling film.",
        "STEP 8",
        "Cover with rice and press down. Press about 3cm of rice over the fish, fold the cling film over and press down as much as you can, using another tin if you have one.",
        "STEP 9",
        "Tip it out like a sandcastle. Turn block of sushi onto a chopping board. Get a grown-up to cut into fingers, then remove the cling film.",
        "STEP 10",
        "TO MAKE SUSHI BALLS: Choose your topping. Get a small square of cling film and place a topping, like half a prawn or a small piece of smoked salmon, on it. Use damp hands to roll walnut-sized balls of rice and place on the topping.",
        "STEP 11",
        "Make into tight balls. Bring the corners of the cling film together and tighten into balls by twisting it up, then unwrap and serve."
      ],
      "tags": [
        "6 serving",
        "easy",
        "sushi"
      ],
      "prepTime": "40 mins",
      "cookTime": "15 mins",
      "author": "Barney Desmazery",
      "link": "https://www.bbcgoodfood.com/recipes/simple-sushi"
    },
    {
      "id": "28",
      "title": "The big double cheeseburger & secret sauce",
      "image": "the_big_double_cheeseburger_secret_sauce",
      "description": "Forget the takeaway and make homemade cheeseburgers – double decker versions. With gherkins, crisp lettuce and a secret sauce, they take some beating.",
      "ingredients": [
        "1 small onion, finely chopped",
        "4 sesame-topped burger buns",
        "300g steak mince",
        "1 tbsp sunflower oil",
        "small wedge of iceberg lettuce, finely shredded",
        "2 slices of mild cheddar or burger cheese",
        "1 gherkin sliced lengthways",
        "oven fries, to serve",
        "",
        "For the secret sauce",
        "",
        "100g mayonnaise",
        "1 tbsp American mustard",
        "large pinch garlic granules",
        "large pinch onion granules",
        "¼ tsp smoked paprika",
        "1 tbsp white wine vinegar",
        "1 tsp pickle relish or finely chopped gherkin"
      ],
      "cookingSteps": [
        "STEP 1",
        "Tip the onions into a small bowl and pour over boiling water from the kettle until just covered. Leave to cool. Put all the sauce ingredients in another small bowl, then add 1 tbsp of the cooled onion water and mix until everything is evenly combined. Set aside.",
        "STEP 2",
        "Halve two of the burger buns, then cut a thick slice from the middles of the other two buns. Toast or grill the middle slices on both sides and the other buns only on the cut sides, then set aside. Heat the oven to 100C/80C fan/gas 2.",
        "STEP 3",
        "Divide the mince into four loose piles and season. Heat ¼ tbsp of the oil in a heavy frying pan or skillet over a high heat and put one of the piles of beef in the pan. Working quickly, cover with a square of baking parchment and carefully use a second pan to press the beef patties down – be careful of the heat and rising steam as you do this. Keep the patties pressed down for about 10 seconds, then remove the weight and the paper, and leave the burger to cook for 2 mins more. Turn the patties and press down using a spatula, cooking for another 1 min. Transfer to a tray and keep warm in the oven while you cook the other burgers in the same way.",
        "STEP 4",
        "When all the patties are cooked, it’s time to assemble the burgers. Spread some sauce over the bun bases, scatter with onions, then add lettuce, followed by a cheese slice, then a patty, a few gherkin slices and a middle slice of toasted bun. Spread over more sauce, then add more onions, lettuce, another patty and the bun tops. Serve with the oven fries and extra sauce on the side, if you like."
      ],
      "tags": [
        "2 servings",
        "easy",
        "burger"
      ],
      "prepTime": "25 mins",
      "cookTime": "15 mins",
      "author": "Barney Desmazery",
      "link": "https://www.bbcgoodfood.com/recipes/the-big-double-cheeseburger-secret-sauce"
    },
    {
      "id": "29",
      "title": "Seitan & black bean stir-fry",
      "image": "seitan_black_bean_stir_fry",
      "description": "This handy vegan stir-fry makes a satisfying supper, with a sticky sweet and spicy sauce. Seitan, peanut butter and a mix of veggies is a winning combination.",
      "ingredients": [
        "For the sauce",
        "",
        "400g can black beans , drained and rinsed",
        "75g dark brown soft sugar",
        "3 garlic cloves",
        "2 tbsp soy sauce",
        "1 tsp Chinese five-spice powder",
        "2 tbsp rice vinegar",
        "1 tbsp smooth peanut butter",
        "1 red chilli , finely chopped",
        "",
        "For the stir-fry",
        "",
        "350g marinated seitan pieces",
        "1 tbsp cornflour",
        "2-3 tbsp vegetable oil",
        "1 red pepper , sliced",
        "300g pak choi , chopped",
        "2 spring onions , sliced",
        "cooked rice noodles or rice, to serve"
      ],
      "cookingSteps": [
        "STEP 1",
        "Start by making the sauce, tip half the beans into the bowl of a food processor with the rest of the ingredients and add 50ml water. Season, then blend until smooth. Pour into a saucepan and heat gently for about 5 mins or until thick and glossy.",
        "STEP 2",
        "Drain the seitan and pat dry with kitchen paper. Toss the seitan pieces in a bowl with the cornflour and set aside. Heat your wok to a high temperature, add a little oil, then the seitan – you might need to do this in batches. Stir-fry for around 5 mins until golden brown at the edges. Remove the seitan from the wok using a slotted spoon and set aside on a plate.",
        "STEP 3",
        "If the wok is dry at this stage, add 1 tsp vegetable oil. Throw in the chopped peppers, the rest of the beans, pak choi and spring onion. Cook for 3-4 mins, then return the seitan to the pan, stir in the sauce and bring to the boil for 1 min. Serve with cooked rice or noodles."
      ],
      "tags": [
        "4 servings",
        "easy",
        "stir-fry"
      ],
      "prepTime": "20 mins",
      "cookTime": "25 mins",
      "author": "Miriam Nice",
      "link": "https://www.bbcgoodfood.com/recipes/seitan-black-bean-stir-fry"
    },
    {
      "id": "30",
      "title": "Salt and pepper chicken",
      "image": "salt_pepper_chicken",
      "description": "Make this easy, spicy salt and pepper chicken dish at home instead of ordering a takeaway. It's cooked with Asian greens in honey and soy, with a hint of Chinese five-spice.",
      "ingredients": [
        "500g skinless, boneless chicken thighs",
        "1 tsp flaky sea salt",
        "1 tsp Sichuan peppercorns (use normal peppercorns if you can't find these)",
        "1 tbsp cornflour",
        "1 tsp Chinese five-spice powder",
        "1 tsp sesame seeds",
        "1 tbsp olive oil",
        "1 tbsp soy sauce",
        "1 tbsp honey",
        "250g Asian greens such as pak choi",
        "handful chopped coriander , sliced spring onions and cooked rice (to serve)"
      ],
      "cookingSteps": [
        "STEP 1",
        "Cut the chicken thighs into strips. Crush the salt with the peppercorns in a pestle and mortar, then mix with the cornflour and five-spice and tip into a sandwich bag. Tip the chicken into the bag and shake well to coat in the flour mixture.",
        "STEP 2",
        "Toss the sesame seeds in a pan over a medium heat and lightly toast, for around a minute, then add the olive oil. Add the chicken and cook for 7-8 mins until golden brown.",
        "STEP 3",
        "Mix the soy and honey and tip into the pan along with the Asian greens, cook for 2-3 mins further until everything is well coated and the greens are cooked through. Serve topped with coriander and sliced spring onions alongside some cooked rice."
      ],
      "tags": [
        "2-3 servings",
        "easy",
        "chicken"
      ],
      "prepTime": "10 mins",
      "cookTime": "15 mins",
      "author": "Elena Silcock",
      "link": "https://www.bbcgoodfood.com/recipes/salt-pepper-chicken"
    },
    {
      "id": "31",
      "title": "Cabbage & chilli slaw",
      "image": "cabbage_chilli_slaw",
      "description": "Serve this cabbage and chilli slaw with doner kebabs. Chill for a day or two, and it will soften and transform into a lighter, kimchi-style slaw.",
      "ingredients": [
        "½ white cabbage , finely sliced",
        ",½ quantity smoky chilli sauce (see recipe in 'Goes well with', below)",
        "½ lemon , juiced",
        "8 spring onions , trimmed and finely sliced on an angle"
      ],
      "cookingSteps": [
        "STEP 1",
        "Toss the cabbage in a bowl with ½ tsp salt. Set aside for 30 mins, then rinse under cold running water. Leave to dry in a colander.",
        "STEP 2",
        "Return the cabbage to the bowl and toss with the chilli sauce, lemon juice and spring onions. Will keep in the fridge for up to two days."
      ],
      "tags": [
        "8 servings",
        "easy",
        "slaw",
        "chilli"
      ],
      "prepTime": "5 mins",
      "cookTime": "0 mins",
      "author": "Tom Kerridge",
      "link": "https://www.bbcgoodfood.com/recipes/cabbage-chilli-slaw"
    }
  ]
}

